---
kind: method
id: M:Autodesk.Revit.DB.STLExportOptions.IsGridAspectRatioSet
source: html/2b9f8526-ddd5-5224-9d8d-6a1c3b61e48b.htm
---
# Autodesk.Revit.DB.STLExportOptions.IsGridAspectRatioSet Method

Checks whether the GridAspectRatio tessellation parameter is explicitly set.

## Syntax (C#)
```csharp
public bool IsGridAspectRatioSet()
```

## Returns
True if GridAspectRatio tessellation parameter is explicitly set, false otherwise.